app/controllers/api/v1/projects_controller.rb

INSERT INTO "projects" ("title", "img_url", "description", "start_date", "end_date", "max_member", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    render json: Project.create(project_params)

DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 10]]
---
  def destroy
  render json: @project.destroy

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def find_project
    @project = Project.find(params[:id])